package org.example.parameters;

import org.testng.annotations.DataProvider;

public class BigDataProviderClass {

        @DataProvider(name="BigProvider")

        public static Object[][] getDataFromDataProvider(){
            return new Object[][] {
                    // >=40 знаков - класс эквивалентности по определению infinity
                    {"888888888888888888888888888888888888888", "40"},
                    // 39 знаков - граница по определению infinity
                    {"888888888888888888888888888888888888888", "39"},
                    // <=38 знаков - класс эквивалентности по определению infinity
                    {"88888888888888888888888888888888888888", "38"},
                    // 10 знаков
                    {"10", "8888888888"},
                    // 9 знаков
                    {"999999999", "888888888"},
                    // 8 знаков
                    {"88888877", "88888888"},
                    // 7 знаков
                    {"7", "8888888"},
                    //  6 знаков
                    {"6", "888888"},
                    //  5 знаков
                    {"5", "888888"},
                    //
                    {"2e9", "748e2"},
            };
        }
}
